<?php
// +----------------------------------------------------------------------
// | ThinkCMF [ WE CAN DO IT MORE SIMPLE ]
// +----------------------------------------------------------------------
// | 官网 http://www.thinkcmf.com
// +----------------------------------------------------------------------
// | 玩转ThinkCMF，欢迎关注ThinkCMF学院！
// +----------------------------------------------------------------------
// | Author: J&C
// +----------------------------------------------------------------------
// | 感谢：ThinkCMF平台 && 老猫
// +----------------------------------------------------------------------
return [
    'float_menu_color' => [
        'title' => '菜单底色',
        'type'  => 'color',
        'value' => '#2780E3',
        'tip'   => '默认蓝色，建议在接近背景的情况下进行调整'
    ],
    'float_menu_switch' => [
        'title' => '选择性开启',
        'type'  => 'select',
		'options' => [
            '1' => 'PC + 移动端',
            '2' => '仅PC',
            '3' => '仅移动端',
            '0' => '不启用'
        ],
        'value' => '1',
        'tip'   => '可选择性开启，请根据自己的需要选择'
    ],
    'float_menu_QQ' => [
        'title' => '客服QQ',
        'type'  => 'text',
        'value' => '',
        'tip'   => '客服QQ，请填入QQ号，为空则不显示'
    ],
    'float_menu_TEL' => [
        'title' => '咨询热线',
        'type'  => 'text',
        'value' => '',
        'tip'   => '咨询热线，请填入电话号码，为空则不显示'
    ],
    'float_menu_shop' => [
        'title' => '网店链接',
        'type'  => 'text',
        'value' => '',
        'tip'   => '网店网址，请填入完整网址（http://www.xxx.com），为空则不显示'
    ],
    'float_menu_QR' => [
        'title' => '二维码',
        'type'  => 'image',
        'value' => '',
        'tip'   => '二维码，请上传需要推广的二维码，为空则不显示'
    ],
    'float_menu_pc_bottom' => [
        'title' => 'PC端垂直位置',
        'type'  => 'number',
        'value' => '',
        'tip'   => '(%)距离底部垂直位置，为空则为默认位置'
    ],
    'float_menu_mobile_bottom' => [
        'title' => '移动端垂直位置',
        'type'  => 'number',
        'value' => '',
        'tip'   => '(%)距离底部垂直位置，为空则为默认位置'
    ],
];
					