<?php
// +----------------------------------------------------------------------
// | TcPrism [ WE CAN DO IT MORE SIMPLE ]
// +----------------------------------------------------------------------
// | Copyright (c) 2018 Tangchao All rights reserved.
// +----------------------------------------------------------------------
// | Author: Tangchao <79300975@qq.com>
// +----------------------------------------------------------------------
return [
    'reward'         => [
        'title'   => '打赏开关',
        'type'    => 'radio',
        'options' => [
            '1' => '开',
            '2' => '关'
        ],
        'value'   => '1',
        'tip'     => '打赏开关'
    ],
    'show'         => [
        'title'   => '文章购买',
        'type'    => 'radio',
        'options' => [
            '1' => '购买后显示隐藏内容',
            '2' => '购买后显示文章'
        ],
        'value'   => '1',
        'tip'     => '文章购买'
    ],
];